{
  "news": [
    {
      "id": 1,
      "title": "Запуск нового курса по React 19",
      "summary": "Мы рады объявить о запуске нового курса, посвящённого последней версии React.",
      "content": "Мы рады объявить о запуске нового курса, посвящённого React 19! В этом курсе мы разберём все новые функции: Server Components, новые хуки, улучшенный Suspense и многое другое. Старт курса запланирован на следующий месяц. Записывайтесь уже сейчас и получите скидку 20% для ранних участников!",
      "date": "2026-02-05",
      "author": "Администрация",
      "image": "https://cdn-icons-png.flaticon.com/512/2721/2721295.png",
      "category": "Курсы"
    },
    {
      "id": 2,
      "title": "Результаты хакатона EduHub 2026",
      "summary": "Подводим итоги ежегодного хакатона. Победители получили ценные призы!",
      "content": "Завершился ежегодный хакатон EduHub 2026! В этом году участвовало более 150 команд из 20 городов. Первое место заняла команда 'CodeMasters' с проектом AI-ассистента для обучения. Поздравляем всех участников и благодарим спонсоров мероприятия!",
      "date": "2026-02-01",
      "author": "Команда EduHub",
      "image": "https://cdn-icons-png.flaticon.com/512/2620/2620686.png",
      "category": "События"
    },
    {
      "id": 3,
      "title": "Партнёрство с ведущими IT-компаниями",
      "summary": "EduHub заключил соглашения о сотрудничестве с крупнейшими IT-компаниями.",
      "content": "Мы с радостью сообщаем о новых партнёрских соглашениях с ведущими IT-компаниями региона. Теперь наши лучшие выпускники получат возможность пройти стажировку и трудоустроиться в компании-партнёры. Это отличная возможность начать карьеру в IT!",
      "date": "2026-01-28",
      "author": "HR отдел",
      "image": "https://cdn-icons-png.flaticon.com/512/3281/3281289.png",
      "category": "Партнёрство"
    },
    {
      "id": 4,
      "title": "Обновление платформы обучения",
      "summary": "Мы обновили нашу платформу: новый дизайн и улучшенный функционал.",
      "content": "Представляем обновлённую версию платформы EduHub! Новый современный дизайн, улучшенный видеоплеер, система достижений и прогресса, интерактивные задания и многое другое. Обновление уже доступно всем пользователям.",
      "date": "2026-01-20",
      "author": "Команда разработки",
      "image": "https://cdn-icons-png.flaticon.com/512/2920/2920349.png",
      "category": "Обновления"
    }
  ]
}
